u44e/multicast_replayer_p4/sdkconfig.defaults
# ESP32-P4 multicast replayer (Ethernet)
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 1ms tick for packet pacing
CONFIG_FREERTOS_HZ=1000

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# PSRAM (most P4 modules: 16/32MB) — large mallocs (stream index) land here
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Internal EMAC + RMII PHY
CONFIG_ETH_USE_ESP32_EMAC=y

# FAT long filenames for SD card paths
CONFIG_FATFS_LFN_HEAP=y

# Console REPL
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
